wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/main.c
/*
 * Debug print
 */
void debug_printf(const char *fmt, ...)
{
  va_list argp;
  va_start(argp, fmt);
  vprint(fmt, argp);
  va_end(argp);
}

#if BOARD_HAS_MASTER_USART
/*
 * Send message via MASTER USART (DMA Normal Mode)
 */
void MASTER_Transmit(uint8_t *buffer, uint8_t len)
{
  // wait until tx buffers are free (send complete)
  while (master_tx_busy)
  {
  }
  master_tx_busy = 1;
  // copy into our master_tx_buffer
  master_tx_buffer_len = len;
  memcpy(master_tx_buffer, buffer, master_tx_buffer_len);
  HAL_UART_Transmit_DMA(&MASTER_USART_Handler, (uint8_t *)master_tx_buffer, master_tx_buffer_len); // send message via UART
}
#endif

/*
 * Initialize Watchdog - not tested yet (by Nekraus)
 */
static void WATCHDOG_vInit(void)
{
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop IWDG at break in debug mode */
  __HAL_FREEZE_IWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* change the period to 50ms */
  IwdgHandle.Instance = IWDG;
  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_256;
  IwdgHandle.Init.Reload = 0xFFF;
  /* Enable IWDG (LSI automatically enabled by HW) */

  /* if window feature is not applied Init() precedes Start() */
  if (HAL_IWDG_Init(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG init Error\r\n");
#endif /* DB_ACTIVE */
  }

/* Initialize WWDG for run time if applicable */
#if defined(DB_ACTIVE)
  /* setup DBGMCU block - stop WWDG at break in debug mode */
  __HAL_FREEZE_WWDG_DBGMCU();
#endif /* DB_ACTIVE */

  /* Setup period - 20ms */
  __WWDG_CLK_ENABLE();
  WwdgHandle.Instance = WWDG;
  WwdgHandle.Init.Prescaler = WWDG_PRESCALER_8;
  WwdgHandle.Init.Counter = 0x7F; /* 40.02 ms*/
  WwdgHandle.Init.Window = 0x7F;  /* 0ms */
  if( HAL_WWDG_Init(&WwdgHandle) != HAL_OK )
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG init Error\r\n");
#endif /* DB_ACTIVE */
  }
} /* WATCHDOG_vInit() */

/*
 * Feed the watchdog every 10ms
 */
static void WATCHDOG_Refresh(void)
{
  /* Update WWDG counter */
  WwdgHandle.Instance = WWDG;
  if (HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" WWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }

  /* Reload IWDG counter */
  IwdgHandle.Instance = IWDG;
  if (HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
  {
#ifdef DB_ACTIVE
    DB_TRACE(" IWDG refresh error\r\n");
#endif /* DB_ACTIVE */
  }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
    if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))
    {
      master_tx_busy = 0;
    }
  }
#endif
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
  // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#if BOARD_HAS_MASTER_USART
  if (huart->Instance == MASTER_USART_INSTANCE)
  {
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
    ULTRASONICSENSOR_ReceiveIT();
#endif
  }
  else
#endif
  if (huart->Instance == BLADEMOTOR_USART_INSTANCE)
  {
    BLADEMOTOR_ReceiveIT();
  }
  else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
  {
    DRIVEMOTOR_ReceiveIT();
  }
}
